# CLI tools
brew "bat" # 'cat' replacement
brew "eza" # 'ls' replacement
brew "zoxide" # 'cd' replacement
brew "fzf" # Fuzzy finder
brew "gdu" # 'du' replacement
brew "ripgrep" # `grep` replacement
brew "tldr" # `man` replacement
brew "git-delta" # Diff pager for `git` and `grep` output
brew "htop"  # 'top' replacement
brew "neofetch" # Displays system info
brew "proxychains-ng" # Proxy tunneling
brew "pwgen" # Password generator
brew "pyenv" # Python version manager
brew "sshpass" # 'ssh' with password flag
brew "starship" # Prompt manager
brew "tree" # Directory listing
brew "wget2" # 'wget' replacement
brew "thefuck"

# GUI apps
cask "alt-tab" # Windows alt-tab for macOS
cask "raycast" # App launcher
cask "zed" # Code editor
cask "bartender" # Menu bar customization
cask "coteditor" # 'TextEdit' replacement
cask "flameshot"  # Screenshots
cask "iterm2" # 'Terminal' replacement
cask "keepassxc" # Password manager
cask "linearmouse" # Mouse improvement
cask "middleclick" # Middle-click for macOS
cask "obsidian" # Notes
cask "rectangle" # Window management
cask "browserosaurus" # Browser manager
cask "visual-studio-code"
cask "dockdoor" # Dock previews (simply amazing)